Repository: RagnarDanneskjold/trader-calculator
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: pt_br

source: How to Use the Calculator
pt_br: Como Utilizar a Calculadora

source: The calculator has a total of six editable text boxes, where four can be used to input values (odds and stakes) and the other two to insert parameters (commission and bias).
pt_br: A calculadora tem um total de seis caixas de texto editáveis, onde quatro podem ser utilizadas para introduzir valores (odds e quantias) e outras duas para inserir parâmetros (comissão e desequilíbrio).

source: The keyboard configuration implemented (see :ref:`navigation` and :ref:`clearing`), allows the user to efficiently insert values with a *desktop keyboard* by placing his two hands in the following way: the left hand can be placed on the left side with the index finger on the *TAB* key and the thumb alternating between the *SPACE* and *SHIFT* keys; the right hand can be used to press the numeric pad and arrows.
pt_br: A configuração do teclado implementada (ver :ref:`navigation` e :ref:`clearing`), permite ao utilizador uma inserção eficiente de valores com um *teclado para desktop* ao posicionar as suas duas mãos da seguinte forma: a mão esquerda pode ser colocada no lado esquerdo do teclado com dedo indicador na tecla *TAB* e o polegar alternando entre as teclas *ESPAÇO* e *SHIFT*; a mão direita pode ser utilizada para premir o teclado numérico e setas.

source: Navigation
pt_br: Navegação

source: Navigation between text boxes is made with the *TAB* and *ENTER* keys. *SHIFT* reverses the orientation.
pt_br: A navegação entre caixas de texto é realizada com as teclas *TAB* e *ENTER*. A tecla *SHIFT*, quando premida em conjunto com as anteriores, inverte o sentido de navegação.

source: The order of the text boxes was defined based on the following assumption: when a trader is observing a market, he is first focused on the odds, and posteriorly on the stakes.
pt_br: A ordem das caixas de texto foi definida com base na seguinte suposição: quando um *trader* está a observar o mercado, este está concentrado em primeiro lugar nas odds e em seguida nas quantias.

source: In order to navigate in the opposite direction, just hold the *SHIFT* key while pressing *TAB* or *ENTER*.
pt_br: De forma a navegar na direcção contrária basta premir a tecla *SHIFT* em conjunto com uma das teclas *TAB* ou *ENTER*.

source: Inserting Values
pt_br: Inserir Valores

source: Values can be inserted like a Python [1]_ float represented in a string that will be parsed by the built-in function float [2]_:
pt_br: Os valores podem ser representados como *floats* "pythonicos" [1]_, isto é, estes serão analisados pela função *float* [2]_, *built-in* da linguagem de programação Python:

source: If there is any error with the input, the calculator is robust enough and will change the background colour to red and cancel the output of results.
pt_br: Se existir algum erro em algum dos valores introduzidos, a calculadora é robusta o suficiente e irá alterar a cor de fundo para vermelho, além de cancelar a apresentação de resultados.

source: The insertion of values can be further improved by using the arrow keys *UP* and *DOWN* to add/subtract 0.01 to the current value.
pt_br: A introdução de valores pode ser ainda mais optimizada ao serem utilizadas as setas *CIMA* e *BAIXO* para adicionar/subtrair 0.01 ao valor actual da caixa de texto.

source: Clearing the Text boxes
pt_br: Limpar Caixas de Texto

source: In case of mistake, or any other reason, the value in the text box can be corrected by either using the *BACKSPACE* key with the arrows *LEFT* and *RIGHT* or by erasing the entire value with the *SPACE* key.
pt_br: Em caso de erro, ou outra qualquer razão, o valor na caixa de texto focada pode ser corrigido com a utilização das teclas *BACKSPACE* e setas *ESQUERDA* e *DIREITA* ou então com a tecla *ESPAÇO* de forma a apagar tudo o que estiver na caixa de texto.

source: In most cases, the last approach is preferred since the user will be using two hands: the left hand to press *SPACE* and the right hand in the numeric pad to introduce the new value.
pt_br: Na maior parte dos casos, a última abordagem é preferida já que o utilizador faz uso das duas mãos: a mão esquerda encontra-se a premir *ESPAÇO* e a mão direita encontrar-se-à no teclado numérico para introduzir o novo valor.

source: In case of apocalypse, or just because the context has changed, the user can always rely on *CTRL+K* to return to the beginning by cleaning all the text boxes.
pt_br: Em caso de holocausto, ou simplesmente porque o contexto mudo, o utilizador pode sempre depender no atalho *CTRL+K* para voltar ao inicio limpando todas as caixas de texto.

source: Getting Results
pt_br: Obter Resultados

source: The application tries to automatically calculate the needed results every time a new character is introduced in any of the editable text boxes.
pt_br: A aplicação tenta calcular automaticamente os resultados necessários de cada vez que um caractere é introduzido numa das caixas de texto editáveis.

source: Its important to notice that once the user fills three text boxes, he is implicitly indicating that he wants to find value of the fourth text box. This means that the last box is the *unknown* variable and that it is no longer editable.
pt_br: É importante notar que uma vez preenchidos três caixas de texto, o utilizador está a indicar implicitamente que quer achar o valor da quarta caixa de texto. Isto significa que esta última caixa é a *variável desconhecida* e que não poderá voltar a ser editada pelo utilizador.

source: In order to change the *unknown* variable the *CTRL+U* keys can be pressed when the wanted variable is focused. Another way to change the *unknown* variable is by *resetting* the calculator (see :ref:`clearing`).
pt_br: De forma a alterar a *variável desconhecida*

source: Introducing Bias
pt_br: Introduzir Desiquilibrio

source: Bias between the profits can be setted in the interval [-1, 1].
pt_br: O valor para o desequilíbrio pode ser estabelecido no intervalo [-1,1].
