Repository: RagnarDanneskjold/trader-calculator
Catalog: lib/locale/*/LC_MESSAGES/trader_calculator.po
Languages: pt

source: Trader Calculator is an eficient tool for the betting exchange users. Features include optimized keyboard navigation, updated results on every keypress, setting of bias between back/lay profits and more.
pt: A calculadora de trading é uma ferramenta eficiente para os utilizadores de bolsas de apostas. As características mais importantes são a utilização optimizada para teclado, actualização automática dos resultados, a definição de desequilíbrio entre os lucros a favor e contra, entre outras.

source: Trader Calculator
pt: Calculadora de Trading

source: Back Odd
pt: Odd a Favor

source: Back Stake
pt: Quantia a Favor

source: Lay Odd
pt: Odd Contra

source: Lay Stake
pt: Quantia Contra

source: Menubar
pt: Barra de Menus

source: Calculator
pt: Calculadora

source: Preferences Alt+Enter
pt: Preferências Alt+Enter

source: Quit Ctrl+Q
pt: Sair Ctrl+Q

source: Edit
pt: Editar

source: Clear Textbox Space
pt: Limpar Caixa de Texto Space

source: Clear All Values Ctrl+K
pt: Limpar Todos os Valores Ctrl+K

source: Set as Unknown Ctrl+U
pt: Definir como Variável Ctrl+U

source: Show Plot Ctrl+P
pt: Mostrar Gráfico Ctrl+P

source: Help
pt: Ajuda

source: Documentation F1
pt: Documentação F1

source: Check for Updates
pt: Verificar Actualização

source: About
pt: Sobre

source: Stake
pt: Quantia

source: Profits
pt: Lucros

source: Back
pt: A Favor

source: Lay
pt: Contra

source: Commission
pt: Comissão

source: Bias
pt: Desequilíbrio

source: Language
pt: Idioma

source: Verbosisty Level
pt: Nível de Verbosidade

source: Cancel
pt: Cancelar

source: Preferences
pt: Preferências

source: Configure the application preferences
pt: Configurar preferências da aplicação

source: Exits the application
pt: Encerrar aplicação

source: Clears focused textbox
pt: Fechar caixa seleccionada

source: Clears odds and stakes
pt: Limpar odds e quantias

source: Set textbox as unknown
pt: Definir caixa de texto como variável

source: Shows bias variation in a plot
pt: Apresenta variação do desequilíbrio num gráfico

source: Shows the documentation
pt: Apresenta a documentação de apoio

source: Checks for updates online
pt: Verificar a existência de Actualizações

source: Shows credits and license
pt: Mostrar créditos e licença
