Repository: RagnarDanneskjold/trader-calculator
Catalog: lib/resources/docs/source/locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: Trader Calculator
pt_br: Calculadora de Trading

source: *Documentation also available in:* `Português <../pt/index.html>`_ |portugal|
pt_br: *Documentação também disponível em:* `English <../en/index.html>`_ |england|

source: *Download the latest version for your platform at* `github <https://github.com/ffunenga/traderCalculator/tree/master/deploy/dist>`_
pt_br: *Faça download da última versão para a sua plataforma no* `github <https://github.com/ffunenga/traderCalculator/tree/master/deploy/dist>`_.

source: Introduction
pt_br: Introdução

source: This application is a simple tool for users of betting exchanges and it is meant to solve the well-known problem of *Bet-Hedging*: configure the profit/losses of two bets - a back and a lay bet - for all outcomes.
pt_br: Esta aplicação é uma ferramenta simples para os utilizadores das bolsas de apostas e propõem-se a resolver o problema bastante conhecido de *Bet-Hedging*: equilibrar os lucros de duas apostas – uma a favor e outra contra – no mesmo acontecimento, ao serem realizadas em momentos diferentes.

source: The main objective in its development was to guarantee the possibility of using solely the keyboard fast and efficiently. Obviously, their exists other solutions of the same kind [1]_ [2]_ [3]_ but all have problems: they depend on the web-browser, none allows keyboard devotion, amongst others.
pt_br: O objectivo principal no seu desenvolvimento foi garantir a possibilidade de utilizar somente o teclado de forma rápida e eficiente. Obviamente, existem outras soluções do mesmo género [1]_ [2]_ [3]_ mas todas têm problemas: dependem do web-browser, nenhuma permite a devoção ao teclado, entre outros.

source: This calculator is an open-source project (GPLv2) and cross-platform. It is implemented as free software aiming to be executed in all platforms supported by wxPython [4]_.
pt_br: Esta calculado é um projecto open-source (GPLv2) e multi-plataforma. Foi implementada enquanto software livre com o objectivo de ser executada em todas as plataformas abrangidas pela biblioteca wxPython [4]_.

source: Documentation
pt_br: Documentação

source: Development
pt_br: Desenvolvimento

source: Suggestions, comments or reviews are welcome! You can send them to filipe.funenga@ist.utl.pt. Also, if you find bugs please create an issue at github [5]_ or send me an email.
pt_br: Sugestões, comentários ou reviews são bem-vindas! Podem enviar-me os mesmos/as para filipe.funenga@ist.utl.pt. Caso encontrem algum problema, podem criar um *issue* no github [5]_ ou enviar-me um email.

source: The development of this application started in 23/Dec/2012 and has been made in Ubuntu 12.04 with Virtualbox running Windows 7.
pt_br: O desenvolvimento desta aplicação foi iniciado em 23/Dez/2012 e tem sido realizado no Ubuntu 12.04 com a Virtualbox a correr o Windows 7.

source: In its current state, a macintosh build is not yet available since I have not immediate access to a macintosh machine. But do not worry, deployment to that framework will be done in the near future.
pt_br: No seu estado actual, a calculadora não possui uma distribuição para macintosh devido à falta de acesso a uma máquina com essa plataforma. Esta limitação será corrigida num futuro próximo!
